10/data/attachments/fbd4ce8abb28d433.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d535f6f4-5973-4e41-a281-afdc7dc84fea</nif:username>
            <nif:friendToBeAdded>Ruben_mother_Friend_71870_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>